Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 03-The-Three-Pigs/CAT/three-pigs/tm/corpus-pilgrim.en.utf8.tmx
Source language: en
Languages: chr

source: Inter. You say truth: For the things which are seen are Temporal; but the things that are not temporal seen are Eternal. [2 Corinthians 4:18] But though this be so, yet since things present and our fleshly appetite are such near neighbors one to another; and, again, because things to come and carnal sense are such strangers one to another; therefore it is that the first of these so suddenly fell into amity, and that distance is so continued between the second. [Romans 7:15-25]
chr: ᎠᏁᏢᏗᏍᎩ. ᏚᏳᎪᏛ ᏂᏫ: ᏄᏓᎴᏒᏰᏃ ᎠᎪᏩᏛᏗ ᏥᎩ ᎦᎶᏐᎲᏍᎩᏉ ᎢᎩ, ᎾᏍᎩᏍᎩᏂ ᎠᎪᏩᏛᏗ ᏂᎨᏒᎾ ᏥᎩ ᎾᏲᎪ ᎠᎵᏍᏆᏗᏍᎩ ᏂᎨᏒᎾ 2 ᎪᎳᏂᏗ 4; 18. ᎾᏍᎩ ᎯᎠ ᎤᏙᎯᏳᎯ ᏄᏍᏗ, ᎠᏎᏃ ᎪᎯᏉ ᎨᏒ ᏤᎾᎠ, ᎤᏇᎵᏃ ᎢᎦᏚᎸᎲᏗ ᎨᏒ ᎾᎥᏂ ᏂᏚᏓᎸ; ᎠᎴ ᎾᏍᏉ ᏂᎦᎵᏍᏙᏗ ᎠᏏ ᎤᎷᎯᏍᏗ ᏥᎩ, ᎠᎴ ᎤᏇᏓᎵ ᎤᏓᏅᏖᎵᏓᏍᏗ ᎨᏒ ᏗᎬᏩᎾᏙᎵᏍᏗ ᏂᎨᏒᎾ ᏥᎩ; ᎾᏍᎩᏰᏃ ᎢᏳᏍᎢ ᎾᏍᎩ ᎯᎠ ᎢᎬᏱ ᏥᏥᏁᎢᏍᏓ ᎢᎬᏪᏅᏛ ᎣᏏᏳ ᏓᎾᏓᏰᎸᏍᎪᎢ; ᏔᎵᏁᏃ ᏥᏥᏁᎢᏍᏓ ᎢᏅᎯᏳ ᏂᏚᏓᎸ ᏅᏩᏍᏗᏗᏐᏉ. ᎶᎻ 7:15-25.
